package org.ClassWork19_04_24;

import java.util.ArrayList;
import java.util.List;
import java.util.Scanner;
public class Test {
    public static void main(String[] args) {
         Scanner scanner = new Scanner(System.in);
//        Создайте программу для тестирования. Вопросы и варианты ответов придумайте сами.
//        Пользователь вводит количество вопросов, на которые хочет ответить. Вопросы выбираются случайным образом из списка.
//        Варианты ответа выводятся в случайном порядке. Программа подсчитывает количество правильных вариантов ответа и процент выполнения.
        System.out.println("На сколько вопросов будете отвечать:");
        int number = scanner.nextInt();
        List<Question> questions = new ArrayList<>();
        questions.add();

    }
}
